[
    {
        "id": "SCN_01_NETFLIX",
        "title": "El Sofá (Netflix & Chill)",
        "description": "Distancia cero. Aburrimiento fingido. Tensión máxima.",
        "base_context": "Estáis en el sofá del salón. Es tarde. Hay una película puesta que nadie está mirando. Compartís una manta. El ambiente es perezoso pero cargado.",
        "environment_variables": [
            "Hace un calor insoportable, ambos lleváis poca ropa.",
            "Se ha ido la luz en todo el edificio. Oscuridad absoluta.",
            "El vecino de arriba está haciendo ruidos de cama muy audibles.",
            "Estáis comiendo pizza con las manos, manchándoos los dedos.",
            "Uno de los dos recibe un mensaje de un ex preguntando '¿estás solo?'.",
            "Se ha derramado vino en la camiseta de uno de los dos.",
            "La película tiene una escena de sexo explícita e incómodamente larga.",
            "Está lloviendo fuera y hace frío, la manta es necesaria para sobrevivir.",
            "El gato/perro se ha puesto en medio, obligando a moverse y tocarse.",
            "Uno de los dos tiene un agujero visible en la ropa de estar por casa."
        ],
        "chaos_cards": [
            "Misión: 'Accidentalmente' roza su entrepierna con el pie y no lo apartes.",
            "Misión: Di que tienes calor y quítate una prenda superior sin avisar.",
            "Misión: Reta al otro a que no es capaz de quitarte el mando a distancia (inicia lucha física).",
            "Misión: Critica la escena de sexo de la TV diciendo 'nosotros lo haríamos mejor'.",
            "Misión: Empieza a hacerle cosquillas, pero termina inmovilizándole las muñecas.",
            "Misión: Susurra: 'Me estás distrayendo de la película' mientras le miras la boca.",
            "Misión: Pon tu cabeza en su regazo y mira hacia arriba sugerentemente.",
            "Misión: Pregunta directamente: '¿Llevas ropa interior ahora mismo?'.",
            "Misión: Insinúa que te gustaría que te masajearan el cuello/espalda.",
            "Misión: Muerde un trozo de comida de la mano del otro.",
            "Misión: Confiesa que no has visto ni un minuto de la película por estar mirándole.",
            "Misión: Di: 'Si me sigues mirando así, no respondo de mis actos'.",
            "Misión: Propón apagar la tele y 'hacer algo más productivo'.",
            "Misión: Juega con su pelo de forma obsesiva.",
            "Misión: Levántate para ir al baño, pero pasa rozando tu cuerpo contra el suyo deliberadamente."
        ]
    },
    {
        "id": "SCN_02_ELEVATOR",
        "title": "El Ascensor Atascado",
        "description": "Claustrofobia convertida en lujuria. Sin testigos.",
        "base_context": "El ascensor se ha detenido entre las plantas 10 y 11. La alarma no suena. Es de noche en un edificio de oficinas/hotel. Nadie va a venir pronto.",
        "environment_variables": [
            "El sistema de ventilación ha muerto. El calor es asfixiante.",
            "La luz de emergencia es roja y tenue, creando un ambiente de club.",
            "El suelo vibra ocasionalmente, creando inestabilidad física.",
            "Uno de los dos tiene una botella de agua y tiene que compartirla.",
            "Suena una música de jazz suave muy irónica.",
            "El espejo del ascensor es enorme y cubre toda la pared.",
            "Uno de los dos lleva ropa de gala (muy ajustada/elegante).",
            "Hay una cámara de seguridad, pero parece apagada (o no).",
            "Uno se sienta en el suelo y tira del otro hacia abajo.",
            "El espacio es minúsculo, apenas podéis giraros sin tocaros."
        ],
        "chaos_cards": [
            "Misión: Di: 'Si vamos a morir aquí, quiero probarte antes'.",
            "Misión: Arrincona al otro contra el espejo usando tu cuerpo.",
            "Misión: Finge un ataque de pánico para que te abrace fuerte.",
            "Misión: Empieza a desabrocharte la camisa/vestido quejándote del calor.",
            "Misión: Sugiere que las cámaras de seguridad no graban audio.",
            "Misión: Toca su cuello fingiendo comprobar su pulso.",
            "Misión: Di: 'Hueles increíblemente bien, es un problema'.",
            "Misión: Propón aprovechar el tiempo para confesar secretos sucios.",
            "Misión: Levanta al otro (o súbete encima) simulando buscar la salida en el techo.",
            "Misión: Muerde tu labio inferior mirando fijamente los suyos.",
            "Misión: Di: 'Tengo la fantasía de hacerlo en un lugar público como este'.",
            "Misión: Desafía al otro a besarte antes de que se abran las puertas.",
            "Misión: Pasa tu mano por la pared cerca de su cabeza (Kabedon).",
            "Misión: Haz un comentario sobre cómo se marca su cuerpo con esa ropa.",
            "Misión: Siéntate en el suelo y abre las piernas invitando al otro a acercarse."
        ]
    },
    {
        "id": "SCN_03_EX_WEDDING",
        "title": "La Boda del Ex",
        "description": "Alcohol, celos y baños cerrados.",
        "base_context": "Boda elegante. Barra libre. La música está muy alta. Todos os miran y juzgan. La tensión de 'somos mejores que ellos' está en el aire.",
        "environment_variables": [
            "Los novios os han sentado en la mesa de los solteros desesperados.",
            "El/La Ex no para de mirar con odio/deseo desde la mesa presidencial.",
            "Habéis encontrado una botella de champán y os la estáis bebiendo a morro.",
            "El vestido/traje de uno de los dos se ha manchado y hay que limpiarlo.",
            "Hay una habitación de hotel reservada arriba que nadie está usando.",
            "Los baños son mixtos o están muy aislados del salón.",
            "Suena la canción que era 'vuestra canción' en el pasado.",
            "Un invitado borracho intenta ligar con uno de vosotros (creando celos).",
            "Os habéis escapado al jardín oscuro lejos de las luces.",
            "Alguien os pregunta si sois actores porno por cómo vestís."
        ],
        "chaos_cards": [
            "Misión: Propón ir al baño de discapacitados a follar AHORA MISMO.",
            "Misión: Mete la mano por debajo de la mesa y toca su pierna/entrepierna.",
            "Misión: Besa al otro salvajemente delante del Ex para marcar territorio.",
            "Misión: Di: 'No llevo ropa interior, compruébalo si quieres'.",
            "Misión: Llévale un trago y bébetelo de su boca.",
            "Misión: Arrástrale a la pista de baile y perrea de forma obscena.",
            "Misión: Insinúa que te vas a ir con el camarero si no te hace caso.",
            "Misión: Critica a la novia/novio diciendo que en la cama seguro que aburre.",
            "Misión: Di en voz alta: 'Me aburro, vámonos a un hotel a romper la cama'.",
            "Misión: Simula que se te ha caído algo para agacharte cerca de su zona.",
            "Misión: Susúrrale qué le harías si estuvierais solos en la suite nupcial.",
            "Misión: Desabrocha disimuladamente el cinturón o cremallera del otro.",
            "Misión: Propón hacer un trío con la dama de honor (sea broma o no).",
            "Misión: Muerde su oreja mientras finges darle un abrazo de felicitación.",
            "Misión: Roba una botella y llévatelo/a al coche."
        ]
    },
    {
        "id": "SCN_04_ROADTRIP",
        "title": "Noche en la Carretera",
        "description": "Aislamiento total. Cristales empañados.",
        "base_context": "Viaje largo. Es de madrugada. Habéis parado en un área de descanso desierta o mirador. El motor está encendido para la calefacción.",
        "environment_variables": [
            "Los cristales se están empañando rápidamente.",
            "El asiento del conductor se reclina totalmente hacia atrás.",
            "Fuera hay niebla densa, parece una película de terror (miedo -> excitación).",
            "Suena una playlist de R&B lento.",
            "Uno de los dos tiene que cambiarse de ropa dentro del coche.",
            "La policía pasa cerca, hay que agacharse y esconderse.",
            "Hay una manta en el maletero que hay que compartir.",
            "Se ha caído el móvil debajo del asiento (excusa para tocar).",
            "Tenéis hambre y solo hay una barrita de chocolate para compartir.",
            "El coche vibra mucho con el motor al ralentí."
        ],
        "chaos_cards": [
            "Misión: Pásate al asiento de atrás y llama al otro con el dedo.",
            "Misión: Di: 'Siempre he tenido la fantasía de hacerlo en un coche'.",
            "Misión: Pon la mano en su muslo mientras mira por la ventana y sube.",
            "Misión: Reta a jugar a 'Verdad o Prenda' (Strip Poker verbal).",
            "Misión: Simula tener mucho frío y métete dentro de su abrigo/sudadera.",
            "Misión: Empieza a besarle el cuello mientras finges buscar algo.",
            "Misión: Reclina su asiento de golpe y ponte encima.",
            "Misión: Di que las ventanas empañadas te dan una idea.",
            "Misión: Pregunta si la palanca de cambios le molesta o le gusta.",
            "Misión: Desabróchale el cinturón de seguridad lentamente.",
            "Misión: Haz un comentario sobre la suspensión del coche y el movimiento rítmico.",
            "Misión: Propón salir al capó (si no llueve) a mirar las estrellas 'y lo que surja'.",
            "Misión: Di: 'Nadie nos oiría si gritamos aquí'.",
            "Misión: Quítate los zapatos y pon los pies en su regazo.",
            "Misión: Insinúa que te gustaría conducir desnudo/a."
        ]
    },
    {
        "id": "SCN_05_FIRST_DATE_DISASTER",
        "title": "Enemies to Lovers",
        "description": "Odio, rabia y deseo reprimido.",
        "base_context": "La cita es un desastre. Habéis discutido. Os caéis mal intelectualmente, pero la atracción física es violenta.",
        "environment_variables": [
            "El restaurante es demasiado pijo y os sentís juzgados.",
            "Habéis bebido demasiado vino para soportar la conversación.",
            "Está lloviendo y os habéis refugiado bajo un toldo pequeño.",
            "El camarero flirtea con uno de vosotros descaradamente.",
            "Uno ha insultado las creencias políticas del otro.",
            "Se os ha caído la comida encima y es un caos.",
            "La tarjeta de crédito ha sido rechazada (vergüenza).",
            "Os habéis encontrado con los padres de uno por accidente.",
            "Uno quiere irse pero el otro le bloquea el paso (juguetón).",
            "Os estáis gritando en la calle, pero muy cerca."
        ],
        "chaos_cards": [
            "Misión: Di: 'Eres insoportable, pero tienes un polvo increíble'.",
            "Misión: Cállale la boca con un beso agresivo en medio de una frase.",
            "Misión: Agárra fuerte su brazo/muñeca y di 'No he terminado contigo'.",
            "Misión: Insulta su inteligencia pero elogia su cuerpo en la misma frase.",
            "Misión: Di: 'Te odio tanto que me pones cachondo/a'.",
            "Misión: Propón 'follar de odio' (hate sex) para cerrar la noche.",
            "Misión: Mírale con desprecio y luego lame tus labios.",
            "Misión: Di: 'Tu opinión es una mierda, pero tu boca no'.",
            "Misión: Arrincona al otro contra la pared mientras discutís.",
            "Misión: Ríete en su cara y di 'Me encanta cuando te enfadas'.",
            "Misión: Propón saltaros la cena e ir a pelear a la cama.",
            "Misión: Di: 'Vas a tener que esforzarte mucho para que te perdone esto'.",
            "Misión: Tírale la copa (o agua) encima 'sin querer' y ofrécete a limpiarlo.",
            "Misión: Di que eres demasiado bueno/a para él/ella, pero harás una excepción.",
            "Misión: Usa el sarcasmo para describir lo que le harías en privado."
        ]
    },
    {
        "id": "SCN_06_OFFICE_LATE",
        "title": "Horas Extras",
        "description": "Oficina vacía. Jerarquía. Prohibido.",
        "base_context": "Son las 22:00. La oficina está vacía. Solo quedáis vosotros dos terminando un proyecto urgente. Sois compañeros o jefe/empleado.",
        "environment_variables": [
            "El personal de limpieza ya se ha ido. Luces apagadas.",
            "Hay una botella de whisky en el despacho del jefe.",
            "La fotocopiadora está encendida y hace ruido rítmico.",
            "Uno de los dos está sentado en la mesa del otro.",
            "Hace frío y el aire acondicionado está a tope.",
            "Tenéis que mirar la misma pantalla de ordenador (cabezas juntas).",
            "Uno lleva la camisa desabrochada o los tacones quitados.",
            "Se oye la tormenta golpear los cristales del rascacielos.",
            "Habéis pedido comida china y estáis comiendo en el suelo.",
            "La silla de la oficina tiene ruedas y permite acercamientos."
        ],
        "chaos_cards": [
            "Misión: Tira los papeles de la mesa al suelo de un manotazo y siéntate encima.",
            "Misión: Di: 'Si el jefe nos viera ahora...'.",
            "Misión: Afloja la corbata del otro o quítale las gafas.",
            "Misión: Propón usar la sala de reuniones para 'reunirnos íntimamente'.",
            "Misión: Di: 'Siempre he querido hacerlo en esta mesa'.",
            "Misión: Pasa por detrás de su silla y masajea sus hombros bajando al pecho.",
            "Misión: Reta a ver quién aguanta más sin tocarse mientras trabajáis.",
            "Misión: Cierra la puerta del despacho con llave lentamente mirándole.",
            "Misión: Di que te has manchado la ropa y necesitas ayuda.",
            "Misión: Juega con el rol de autoridad ('Te voy a castigar/despedir').",
            "Misión: Usa la luz del móvil para iluminar solo su boca o escote.",
            "Misión: Propón un descanso de 5 minutos 'intensos'.",
            "Misión: Muerde un bolígrafo de forma sugerente mientras le miras.",
            "Misión: Di: 'Odio este trabajo, pero me encanta verte trabajar'.",
            "Misión: Insinúa que llevas todo el día pensando en él/ella desnudo/a."
        ]
    }
]